artillery-tests/shorts-tests/deletes/delete_all_shorts.yaml
config:
    target: http://127.0.0.1:8081/tukano-users-shorts-1/rest
    phases:
        - name: delete_all_shorts_phase
          duration: 1
          arrivalRate: 1
scenarios:
    - name: DeleteAllShorts
      flow:
        - delete:
            url: /shorts/USERID/shorts?pwd=PASSWORD&token=ACCESSTOKEN
            headers:
                Content-Type: application/json